#include "Header_ITiP_2nd_year_2nd_semmester.h"

void GreetingForTheUser_void() //Начальная информация для пользователя 
{
	std::cout << "+-------------------------------------------------------------------------------+" << std::endl;
	std::cout << "| Доброл пожаловать в программу по предмету:                                    |" << std::endl;
	std::cout << "| Информационные технологии и программирования                                  |" << std::endl;
	std::cout << "| Данная программа написана студентом:                                          |" << std::endl;
	std::cout << "| из группы УБСТ-2404                                                           |" << std::endl;
	std::cout << "| Миронов Владислав Дмитриевич (MirDiWay)                                       |" << std::endl;
	std::cout << "| 14 вариант                                                                    |" << std::endl;
	std::cout << "| В данной программе поэтапно программируется выполнение задач,                 |\n";
	std::cout << "| пока курс не завершиться или не нужно будеть написать более сложную программу |\n";
	std::cout << "| которую не получится разместить в этом коде                                   |" << std::endl;
	std::cout << "+-------------------------------------------------------------------------------+" << std::endl << std::endl << std::endl << std::endl;
}