// Не понимаю я этот ваш C++. 
// Фактически, моим первым языком программирования стал PascalABC.NET для сдачи ОГЭ
// я программирование тогда понимал отнють не как программирование. 
// Сейчас я пишу на C#, и мне нравится этот язык программирования
// На нем можно написать так же десктопные программы и игры....
// Так же я не против изучения таких языков как Pythone - потому что ии и тоже интересный язык
// А так же JavaScript потому что это один из крутых языков прогрмаммирования по созданию
// красивого фронтента и сайтов.

// Конечно, благодаря C# я знаю синтаксис языка программирования, и что я делаю в этой программе я понимаю
// но не догоняю, меня этот C++ путает, а в связи с тем, что я не планирую развивать свои знания в C++
// я делаю эту программу, лишь бы что бы сдать, а не что бы изучить. Уж простите меня пожалуйста, кто будет это читать
// но дальнейшия разработка на этом языке программирования не буедт вестись.

// Мне интерес приносит писать на C# это для меня даже игра, писать на других языках, но C++, я отвергаю для себя